{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies/$entity",
  "@odata.type": "#microsoft.graph.conditionalAccessPolicy",
  "@odata.id": "identity/conditionalAccess/policies('3da64d5f-29f0-4c5a-9b38-3cd5f53daf77')",
  "@odata.editLink": "identity/conditionalAccess/policies('3da64d5f-29f0-4c5a-9b38-3cd5f53daf77')",
  "id": "3da64d5f-29f0-4c5a-9b38-3cd5f53daf77",
  "templateId": null,
  "displayName": "CAD004-O365: Grant Require MFA for All users when Browser and Non-Compliant-v1.3",
  "createdDateTime@odata.type": "#DateTimeOffset",
  "createdDateTime": "2023-02-04T17:55:42.7305687Z",
  "modifiedDateTime@odata.type": "#DateTimeOffset",
  "modifiedDateTime": "2025-01-23T09:41:40.1143973Z",
  "state@odata.type": "#microsoft.graph.conditionalAccessPolicyState",
  "state": "enabledForReportingButNotEnforced",
  "deletedDateTime": null,
  "partialEnablementStrategy": null,
  "sessionControls": null,
  "conditions": {
    "@odata.type": "#microsoft.graph.conditionalAccessConditionSet",
    "userRiskLevels@odata.type": "#Collection(microsoft.graph.riskLevel)",
    "userRiskLevels": [],
    "signInRiskLevels@odata.type": "#Collection(microsoft.graph.riskLevel)",
    "signInRiskLevels": [],
    "clientAppTypes@odata.type": "#Collection(microsoft.graph.conditionalAccessClientApp)",
    "clientAppTypes": [
      "browser"
    ],
    "platforms": null,
    "locations": null,
    "times": null,
    "deviceStates": null,
    "clientApplications": null,
    "applications": {
      "@odata.type": "#microsoft.graph.conditionalAccessApplications",
      "includeApplications@odata.type": "#Collection(String)",
      "includeApplications": [
        "Office365"
      ],
      "excludeApplications@odata.type": "#Collection(String)",
      "excludeApplications": [],
      "includeUserActions@odata.type": "#Collection(String)",
      "includeUserActions": [],
      "includeAuthenticationContextClassReferences@odata.type": "#Collection(String)",
      "includeAuthenticationContextClassReferences": [],
      "applicationFilter": null
    },
    "users": {
      "@odata.type": "#microsoft.graph.conditionalAccessUsers",
      "includeUsers@odata.type": "#Collection(String)",
      "includeUsers": [
        "All"
      ],
      "excludeUsers@odata.type": "#Collection(String)",
      "excludeUsers": [],
      "includeGroups@odata.type": "#Collection(String)",
      "includeGroups": [],
      "excludeGroups@odata.type": "#Collection(String)",
      "excludeGroups": [
        "2e94bf90-1dc9-4780-93d1-b15db1acf402",
        "79a5727e-811c-4aa5-aff1-2e1966a0d4be"
      ],
      "includeRoles@odata.type": "#Collection(String)",
      "includeRoles": [],
      "excludeRoles@odata.type": "#Collection(String)",
      "excludeRoles": [],
      "includeGuestsOrExternalUsers": null,
      "excludeGuestsOrExternalUsers": null
    },
    "devices": {
      "@odata.type": "#microsoft.graph.conditionalAccessDevices",
      "includeDeviceStates@odata.type": "#Collection(String)",
      "includeDeviceStates": [],
      "excludeDeviceStates@odata.type": "#Collection(String)",
      "excludeDeviceStates": [],
      "includeDevices@odata.type": "#Collection(String)",
      "includeDevices": [],
      "excludeDevices@odata.type": "#Collection(String)",
      "excludeDevices": [],
      "deviceFilter": {
        "@odata.type": "#microsoft.graph.conditionalAccessFilter",
        "mode@odata.type": "#microsoft.graph.filterMode",
        "mode": "exclude",
        "rule": "device.isCompliant -eq True -or device.trustType -eq \"ServerAD\""
      }
    }
  },
  "grantControls": {
    "@odata.type": "#microsoft.graph.conditionalAccessGrantControls",
    "operator": "OR",
    "builtInControls@odata.type": "#Collection(microsoft.graph.conditionalAccessGrantControl)",
    "builtInControls": [],
    "customAuthenticationFactors@odata.type": "#Collection(String)",
    "customAuthenticationFactors": [],
    "termsOfUse@odata.type": "#Collection(String)",
    "termsOfUse": [],
    "authenticationStrength@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies('3da64d5f-29f0-4c5a-9b38-3cd5f53daf77')/grantControls/authenticationStrength/$entity",
    "authenticationStrength@odata.associationLink": "https://graph.microsoft.com/beta/identity/conditionalAccess/policies('3da64d5f-29f0-4c5a-9b38-3cd5f53daf77')/grantControls/authenticationStrength/$ref",
    "authenticationStrength@odata.navigationLink": "https://graph.microsoft.com/beta/identity/conditionalAccess/policies('3da64d5f-29f0-4c5a-9b38-3cd5f53daf77')/grantControls/authenticationStrength",
    "authenticationStrength": {
      "@odata.type": "#microsoft.graph.authenticationStrengthPolicy",
      "@odata.id": "identity/conditionalAccess/policies('3da64d5f-29f0-4c5a-9b38-3cd5f53daf77')/grantControls/authenticationStrength",
      "@odata.editLink": "identity/conditionalAccess/policies('3da64d5f-29f0-4c5a-9b38-3cd5f53daf77')/grantControls/authenticationStrength",
      "id": "eaedd457-3e01-413b-a02e-417489193d1d",
      "createdDateTime@odata.type": "#DateTimeOffset",
      "createdDateTime": "2025-01-23T09:37:53.7086447Z",
      "modifiedDateTime@odata.type": "#DateTimeOffset",
      "modifiedDateTime": "2025-01-23T09:38:39.1127433Z",
      "displayName": "Custom MFA",
      "description": "",
      "policyType@odata.type": "#microsoft.graph.authenticationStrengthPolicyType",
      "policyType": "custom",
      "requirementsSatisfied@odata.type": "#microsoft.graph.authenticationStrengthRequirements",
      "requirementsSatisfied": "mfa",
      "allowedCombinations@odata.type": "#Collection(microsoft.graph.authenticationMethodModes)",
      "allowedCombinations": [
        "windowsHelloForBusiness",
        "fido2",
        "x509CertificateMultiFactor",
        "deviceBasedPush",
        "temporaryAccessPassOneTime",
        "temporaryAccessPassMultiUse",
        "password,microsoftAuthenticatorPush"
      ],
      "combinationConfigurations@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies('3da64d5f-29f0-4c5a-9b38-3cd5f53daf77')/grantControls/authenticationStrength/combinationConfigurations",
      "combinationConfigurations@odata.associationLink": "https://graph.microsoft.com/beta/identity/conditionalAccess/policies('3da64d5f-29f0-4c5a-9b38-3cd5f53daf77')/grantControls/authenticationStrength/combinationConfigurations/$ref",
      "combinationConfigurations@odata.navigationLink": "https://graph.microsoft.com/beta/identity/conditionalAccess/policies('3da64d5f-29f0-4c5a-9b38-3cd5f53daf77')/grantControls/authenticationStrength/combinationConfigurations",
      "combinationConfigurations": [],
      "#microsoft.graph.updateAllowedCombinations": {
        "title": "microsoft.graph.updateAllowedCombinations",
        "target": "https://graph.microsoft.com/beta/identity/conditionalAccess/policies('3da64d5f-29f0-4c5a-9b38-3cd5f53daf77')/grantControls/authenticationStrength/microsoft.graph.updateAllowedCombinations"
      },
      "#microsoft.graph.usage": {
        "title": "microsoft.graph.usage",
        "target": "https://graph.microsoft.com/beta/identity/conditionalAccess/policies('3da64d5f-29f0-4c5a-9b38-3cd5f53daf77')/grantControls/authenticationStrength/microsoft.graph.usage"
      }
    }
  },
  "#microsoft.graph.restore": {
    "title": "microsoft.graph.restore",
    "target": "https://graph.microsoft.com/beta/identity/conditionalAccess/policies('3da64d5f-29f0-4c5a-9b38-3cd5f53daf77')/microsoft.graph.restore"
  }
}
