{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies/$entity",
  "@odata.type": "#microsoft.graph.conditionalAccessPolicy",
  "@odata.id": "identity/conditionalAccess/policies('dbe08f77-0a23-4cec-9401-2168b38d48be')",
  "@odata.editLink": "identity/conditionalAccess/policies('dbe08f77-0a23-4cec-9401-2168b38d48be')",
  "id": "dbe08f77-0a23-4cec-9401-2168b38d48be",
  "templateId": null,
  "displayName": "CAU008-All: Grant Require Phishing Resistant MFA for Admins when Browser and Modern Auth Clients-v1.4",
  "createdDateTime@odata.type": "#DateTimeOffset",
  "createdDateTime": "2025-03-04T09:49:59.0823807Z",
  "modifiedDateTime": null,
  "state@odata.type": "#microsoft.graph.conditionalAccessPolicyState",
  "state": "enabledForReportingButNotEnforced",
  "deletedDateTime": null,
  "partialEnablementStrategy": null,
  "sessionControls": null,
  "conditions": {
    "@odata.type": "#microsoft.graph.conditionalAccessConditionSet",
    "userRiskLevels@odata.type": "#Collection(microsoft.graph.riskLevel)",
    "userRiskLevels": [],
    "signInRiskLevels@odata.type": "#Collection(microsoft.graph.riskLevel)",
    "signInRiskLevels": [],
    "clientAppTypes@odata.type": "#Collection(microsoft.graph.conditionalAccessClientApp)",
    "clientAppTypes": [
      "browser",
      "mobileAppsAndDesktopClients"
    ],
    "platforms": null,
    "locations": null,
    "times": null,
    "deviceStates": null,
    "devices": null,
    "clientApplications": null,
    "applications": {
      "@odata.type": "#microsoft.graph.conditionalAccessApplications",
      "includeApplications@odata.type": "#Collection(String)",
      "includeApplications": [
        "All"
      ],
      "excludeApplications@odata.type": "#Collection(String)",
      "excludeApplications": [],
      "includeUserActions@odata.type": "#Collection(String)",
      "includeUserActions": [],
      "includeAuthenticationContextClassReferences@odata.type": "#Collection(String)",
      "includeAuthenticationContextClassReferences": [],
      "applicationFilter": null
    },
    "users": {
      "@odata.type": "#microsoft.graph.conditionalAccessUsers",
      "includeUsers@odata.type": "#Collection(String)",
      "includeUsers": [],
      "excludeUsers@odata.type": "#Collection(String)",
      "excludeUsers": [],
      "includeGroups@odata.type": "#Collection(String)",
      "includeGroups": [],
      "excludeGroups@odata.type": "#Collection(String)",
      "excludeGroups": [
        "15970ea5-bc0e-4ecf-84eb-7520b7b1254a",
        "79a5727e-811c-4aa5-aff1-2e1966a0d4be"
      ],
      "includeRoles@odata.type": "#Collection(String)",
      "includeRoles": [
        "9b895d92-2cd3-44c7-9d02-a6ac2d5ea5c3",
        "cf1c38e5-3621-4004-a7cb-879624dced7c",
        "c4e39bd9-1100-46d3-8c65-fb160da0071f",
        "25a516ed-2fa0-40ea-a2d0-12923a21473a",
        "aaf43236-0c0d-4d5f-883a-6955382ac081",
        "b0f54661-2d74-4c50-afa3-1ec803f12efe",
        "158c047a-c907-4556-b7ef-446551a6b5f7",
        "7698a772-787b-4ac8-901f-60d6b08affd2",
        "17315797-102d-40b4-93e0-432062caca18",
        "b1be1c3e-b65d-4f19-8427-f6fa0d97feb9",
        "9360feb5-f418-4baa-8175-e2a00bac4301",
        "29232cdf-9323-42fd-ade2-1d097af3e4de",
        "62e90394-69f5-4237-9190-012177145e10",
        "f2ef992c-3afb-46b9-b7cf-a126ee74c451",
        "729827e3-9c14-49f7-bb1b-9608f156bbb8",
        "8ac3fc64-6eca-42ea-9e69-59f4c7b60eb2",
        "3a2c62db-5318-420d-8d74-23affee5d9d5",
        "966707d0-3269-4727-9be2-8c3a10f19b9d",
        "7be44c8a-adaf-4e2a-84d6-ab2649e08a13",
        "e8611ab8-c189-46e8-94e1-60213ab1f814",
        "194ae4cb-b126-40b2-bd5b-6091b380977d",
        "5f2222b1-57c3-48ba-8ad5-d4759f1fde6f",
        "5d6b6bb7-de71-4623-b4af-96380a352509",
        "f28a1f50-f6e7-4571-818b-6a12f2af6b6c",
        "69091246-20e8-4a56-aa4d-066075b2a7a8",
        "fe930be7-5e62-47db-91af-98c3a49a38b1"
      ],
      "excludeRoles@odata.type": "#Collection(String)",
      "excludeRoles": [],
      "includeGuestsOrExternalUsers": null,
      "excludeGuestsOrExternalUsers": {
        "@odata.type": "#microsoft.graph.conditionalAccessGuestsOrExternalUsers",
        "guestOrExternalUserTypes@odata.type": "#microsoft.graph.conditionalAccessGuestOrExternalUserTypes",
        "guestOrExternalUserTypes": "serviceProvider",
        "externalTenants": {
          "@odata.type": "#microsoft.graph.conditionalAccessAllExternalTenants",
          "membershipKind@odata.type": "#microsoft.graph.conditionalAccessExternalTenantsMembershipKind",
          "membershipKind": "all"
        }
      }
    }
  },
  "grantControls": {
    "@odata.type": "#microsoft.graph.conditionalAccessGrantControls",
    "operator": "OR",
    "builtInControls@odata.type": "#Collection(microsoft.graph.conditionalAccessGrantControl)",
    "builtInControls": [],
    "customAuthenticationFactors@odata.type": "#Collection(String)",
    "customAuthenticationFactors": [],
    "termsOfUse@odata.type": "#Collection(String)",
    "termsOfUse": [],
    "authenticationStrength@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies('dbe08f77-0a23-4cec-9401-2168b38d48be')/grantControls/authenticationStrength/$entity",
    "authenticationStrength@odata.associationLink": "https://graph.microsoft.com/beta/identity/conditionalAccess/policies('dbe08f77-0a23-4cec-9401-2168b38d48be')/grantControls/authenticationStrength/$ref",
    "authenticationStrength@odata.navigationLink": "https://graph.microsoft.com/beta/identity/conditionalAccess/policies('dbe08f77-0a23-4cec-9401-2168b38d48be')/grantControls/authenticationStrength",
    "authenticationStrength": {
      "@odata.type": "#microsoft.graph.authenticationStrengthPolicy",
      "@odata.id": "identity/conditionalAccess/policies('dbe08f77-0a23-4cec-9401-2168b38d48be')/grantControls/authenticationStrength",
      "@odata.editLink": "identity/conditionalAccess/policies('dbe08f77-0a23-4cec-9401-2168b38d48be')/grantControls/authenticationStrength",
      "id": "00000000-0000-0000-0000-000000000004",
      "createdDateTime@odata.type": "#DateTimeOffset",
      "createdDateTime": "2021-12-01T08:00:00Z",
      "modifiedDateTime@odata.type": "#DateTimeOffset",
      "modifiedDateTime": "2021-12-01T08:00:00Z",
      "displayName": "Phishing-resistant MFA",
      "description": "Phishing-resistant, Passwordless methods for the strongest authentication, such as a FIDO2 security key",
      "policyType@odata.type": "#microsoft.graph.authenticationStrengthPolicyType",
      "policyType": "builtIn",
      "requirementsSatisfied@odata.type": "#microsoft.graph.authenticationStrengthRequirements",
      "requirementsSatisfied": "mfa",
      "allowedCombinations@odata.type": "#Collection(microsoft.graph.authenticationMethodModes)",
      "allowedCombinations": [
        "windowsHelloForBusiness",
        "fido2",
        "x509CertificateMultiFactor"
      ],
      "combinationConfigurations@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies('dbe08f77-0a23-4cec-9401-2168b38d48be')/grantControls/authenticationStrength/combinationConfigurations",
      "combinationConfigurations@odata.associationLink": "https://graph.microsoft.com/beta/identity/conditionalAccess/policies('dbe08f77-0a23-4cec-9401-2168b38d48be')/grantControls/authenticationStrength/combinationConfigurations/$ref",
      "combinationConfigurations@odata.navigationLink": "https://graph.microsoft.com/beta/identity/conditionalAccess/policies('dbe08f77-0a23-4cec-9401-2168b38d48be')/grantControls/authenticationStrength/combinationConfigurations",
      "combinationConfigurations": [],
      "#microsoft.graph.updateAllowedCombinations": {
        "title": "microsoft.graph.updateAllowedCombinations",
        "target": "https://graph.microsoft.com/beta/identity/conditionalAccess/policies('dbe08f77-0a23-4cec-9401-2168b38d48be')/grantControls/authenticationStrength/microsoft.graph.updateAllowedCombinations"
      },
      "#microsoft.graph.usage": {
        "title": "microsoft.graph.usage",
        "target": "https://graph.microsoft.com/beta/identity/conditionalAccess/policies('dbe08f77-0a23-4cec-9401-2168b38d48be')/grantControls/authenticationStrength/microsoft.graph.usage"
      }
    }
  },
  "#microsoft.graph.restore": {
    "title": "microsoft.graph.restore",
    "target": "https://graph.microsoft.com/beta/identity/conditionalAccess/policies('dbe08f77-0a23-4cec-9401-2168b38d48be')/microsoft.graph.restore"
  }
}
